In [2]:
import sqlite3
conn = sqlite3.connect('BookStore.db')
print("Opened database successfully");

Opened database successfully

In [3]:
# Table 1 Query:
conn.execute('''CREATE TABLE Books
(
Id INT PRIMARY KEY,
Name VARCHAR (50) NOT NULL,
Price INT,
CategoryId INT, 
AuthorId INT
);''')
conn.commit()

In [6]:
# Table 2 Query:
conn.execute('''CREATE TABLE Categories
(
Id INT PRIMARY KEY,
Name VARCHAR (50) NOT NULL
);''')
conn.commit()

In [8]:
# Table 3 Query:
conn.execute('''CREATE TABLE Authors
(
Id INT PRIMARY KEY,
Name VARCHAR (50) NOT NULL
);''')
conn.commit()

In [9]:
conn.execute('''INSERT INTO Categories 
VALUES (1, 'Cat-A'),
(2, 'Cat-B'),
(3, 'Cat-C'),
(7, 'Cat-D'),
(8, 'Cat-E'),
(4, 'Cat-F'),
(10,'Cat-G'),
(12,'Cat-H'),
(6, 'Cat-I');''')
conn.commit()

In [10]:
conn.execute('''INSERT INTO Authors
VALUES (1, 'Author-A'),
(2, 'Author-B'),
(3, 'Author-C'),
(10, 'Author-D'),
(12, 'Author-E');''')
conn.commit()

In [13]:
conn.execute('''INSERT INTO Books 
VALUES ( 01,'Book-A', 100, 1, 2),
( 02,'Book-B', 200, 2, 2),
( 03,'Book-C', 150, 3, 2),
( 04,'Book-D', 100, 3,1),
( 05,'Book-E', 200, 3,1),
( 06,'Book-F', 150, 4,1),
( 07,'Book-G', 100, 5,5),
( 08,'Book-H', 200, 5,6),
(09,'Book-I', 150, 7,8);''')
conn.commit()

```
INNER JOIN

In [16]:
inner_join=conn.execute('''select * from Books inner join Categories on Books.CategoryId = Categories.Id''')
for i in inner_join:
  print(i)

(1, 'Book-A', 100, 1, 2, 1, 'Cat-A')
(2, 'Book-B', 200, 2, 2, 2, 'Cat-B')
(3, 'Book-C', 150, 3, 2, 3, 'Cat-C')
(4, 'Book-D', 100, 3, 1, 3, 'Cat-C')
(5, 'Book-E', 200, 3, 1, 3, 'Cat-C')
(6, 'Book-F', 150, 4, 1, 4, 'Cat-F')
(9, 'Book-I', 150, 7, 8, 7, 'Cat-D')

```
LEFT JOIN

In [17]:
left_join=conn.execute('''select * from Books left join Categories on Books.CategoryId = Categories.Id''')
for i in left_join:
  print(i)

(1, 'Book-A', 100, 1, 2, 1, 'Cat-A')
(2, 'Book-B', 200, 2, 2, 2, 'Cat-B')
(3, 'Book-C', 150, 3, 2, 3, 'Cat-C')
(4, 'Book-D', 100, 3, 1, 3, 'Cat-C')
(5, 'Book-E', 200, 3, 1, 3, 'Cat-C')
(6, 'Book-F', 150, 4, 1, 4, 'Cat-F')
(7, 'Book-G', 100, 5, 5, None, None)
(8, 'Book-H', 200, 5, 6, None, None)
(9, 'Book-I', 150, 7, 8, 7, 'Cat-D')

```
RIGHT JOIN

In [ ]:
right_join=conn.execute('''select * from Books right join Categories on Books.CategoryId = Categories.Id''')
for i in right_join:
  print(i)

```
FULL OUTER OR FULL JOIN

In [ ]:
outer_join=conn.execute('''select * from Books full outer join Categories on Books.CategoryId = Categories.Id''')
for i in outer_join:
  print(i)

```
SELECT Queries

In [19]:
select_join=conn.execute('''select Books.Name,Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id''')
for i in select_join:
  print(i)

('Book-A', 'Author-B')
('Book-B', 'Author-B')
('Book-C', 'Author-B')
('Book-D', 'Author-A')
('Book-E', 'Author-A')
('Book-F', 'Author-A')

In [23]:
select_join=conn.execute('''select Authors.Name,count(Books.Name) from Books inner join Authors on Books.AuthorId = Authors.Id group by Authors.Name''')
for i in select_join:
  print(i)

('Author-A', 3)
('Author-B', 3)

In [24]:
select_join=conn.execute('''select Books.Name,Books.Price,Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id''')
for i in select_join:
  print(i)

('Book-A', 100, 'Author-B')
('Book-B', 200, 'Author-B')
('Book-C', 150, 'Author-B')
('Book-D', 100, 'Author-A')
('Book-E', 200, 'Author-A')
('Book-F', 150, 'Author-A')

In [30]:
select_join=conn.execute('''select count(Books.Price),Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id group by Authors.Name''')
for i in select_join:
  print(i)

(3, 'Author-A')
(3, 'Author-B')

In [31]:
select_join=conn.execute('''select Books.Price,count(Authors.Name) from Books inner join Authors on Books.AuthorId = Authors.Id group by Books.Price''')
for i in select_join:
  print(i)

(100, 2)
(150, 2)
(200, 2)

In [33]:
select_join=conn.execute('''select Books.Name,Books.Price,Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id order by Books.Price''')
for i in select_join:
  print(i)

('Book-A', 100, 'Author-B')
('Book-D', 100, 'Author-A')
('Book-C', 150, 'Author-B')
('Book-F', 150, 'Author-A')
('Book-B', 200, 'Author-B')
('Book-E', 200, 'Author-A')

In [34]:
select_join=conn.execute('''select Books.Name,Books.Price,Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id order by Books.Price desc''')
for i in select_join:
  print(i)

('Book-B', 200, 'Author-B')
('Book-E', 200, 'Author-A')
('Book-C', 150, 'Author-B')
('Book-F', 150, 'Author-A')
('Book-A', 100, 'Author-B')
('Book-D', 100, 'Author-A')

In [38]:
select_join=conn.execute('''select Books.Name,Books.Price,Authors.Name from Books inner join Authors on Books.AuthorId = Authors.Id order by Books.Price desc limit 2''')
for i in select_join:
  print(i)

('Book-B', 200, 'Author-B')
('Book-E', 200, 'Author-A')